
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_repository.settings_all["atc-router"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"07d2c8dfe7605c3ddced5c9e4de5540061db16aed090273bdcb3c1296de22b82\"" -> "W/\"97610c267cee3a36b50634038e70fc8c532375eaa0b37c894dcdf05a76673d1e\""
        id                          = "atc-router"
        name                        = "atc-router"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-development"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"fc6bad6fc4980f49141ad1e6a57080310124ca4952a95aa8b03d5313af29c66d\"" -> "W/\"5ddccdcf6d6ab3acd334d9e9815256da9cf78a11399e6dbcec756b67be7ecb77\""
        id                          = "kong-development"
        name                        = "kong-development"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-docker"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"a27ebae194c811f7013a23a45473f82f4a822dfc4ad0d9c89d9cb64f8e8934aa\"" -> "W/\"b4ac81e1adf9682276b89cc3c20b2b521b5450956de0006d9cc870d417bb960c\""
        id                          = "kong-docker"
        name                        = "kong-docker"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-openssl"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"88de7a0dc72b93f5029b5775385cb07e4c11894b929c7e28de0a40c0958bbb1e\"" -> "W/\"5b0d115023236a2eba5f0672f6172a7f4c4c80d110f892f5434936b169eadbad\""
        id                          = "kong-openssl"
        name                        = "kong-openssl"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-package"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"315f612a4bdc1681a44d6f147f1018ce29db4d6f7b747b004e19cca0f75ed356\"" -> "W/\"dc9190c940fbcedf9a9f59c3b59df582c6b2f994d9a081a6dd7b400402f253ba\""
        id                          = "kong-package"
        name                        = "kong-package"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-runtime"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"c41feae1208599b5d6ef3b73e33637ee38d61eb028cb8017b6e4c732efd2939b\"" -> "W/\"28ca815e4bc5ac82afc04ee5c51aa8945578c3892b2df18bdf41b505af8dd20c\""
        id                          = "kong-runtime"
        name                        = "kong-runtime"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-test-suite"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"e05d96227b4d2883b42ab968441f8a6e77cea6fd7af3a3b8e03742cb32392598\"" -> "W/\"984823d39f0f79dc6c54b77a740d4f2d23bc1dcc27e57c93b03c558118ad84c2\""
        id                          = "kong-test-suite"
        name                        = "kong-test-suite"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["multi-arch-fpm"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"dd4a2a012fbf83f0acdb18545ebd1819d1137b15d8e7981f23a551ddde618c1e\"" -> "W/\"fe1751282f38068dc2786d308ef6a73b92d8c7ab5b1ba137cd08566d24b7dfc5\""
        id                          = "multi-arch-fpm"
        name                        = "multi-arch-fpm"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["template-template"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"f0fe592a6e2f2fcb4d58bb54e5da94bd753d023c6c34bb4cf9c180ddffd63ec9\"" -> "W/\"be2da9373116076ad67fa0b202ceb1cb55d3a539127a3936e6a51ce5a25b3d3a\""
        id                          = "template-template"
        name                        = "template-template"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["atc-router"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"667c6bb69e6ff5bdbc7e323dd61acb0048120d513d902e39b53ba21339936902\"" -> "W/\"5702b17cbaf54b2218ba9d04b127eed06337a75cd81c254fde1ea19d9c866261\""
        id          = "1481994"
        name        = "protect-main-branch-atc-router-pre-commit-20240822-070844"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-build-images"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"340bb56251ff11372857a5034b0009bd5b44ade1a40ca7d387a3b1271abc9146\"" -> "W/\"020b77718b70d9ad915bcebf1e50c6b9f8291830649680c2983cc6195efa5184\""
        id          = "1430804"
        name        = "protect-main-branch-kong-build-images-pre-commit-20240822-070844"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-development"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"3845d428562e80a1f5f22e1102dcc562b43efb7e7ee0905fc7bc62733e0b81e8\"" -> "W/\"977d26a967e6d93fa4a976ff123bf9bef83b35de5b236a955aaed8e7294c9786\""
        id          = "1430806"
        name        = "protect-main-branch-kong-development-pre-commit-20240822-070844"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-openssl"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"f90be4cb33714a27172a683651d9a27cff45c47551fb49129aae16d035f41681\"" -> "W/\"9c02ca346321739e6972cf04e09692690184a8371005fc6f166a4050e1d436c7\""
        id          = "1430805"
        name        = "protect-main-branch-kong-openssl-pre-commit-20240822-070844"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-package"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"7b725370dc0a6e0e83ffc627c42f0e43de8058defd5a237ace531b3ff0e68233\"" -> "W/\"b4e3c4f716f46cd0a9bc06d17a9af20a10d17d2a84031fa11c9a79ddc09241de\""
        id          = "1430802"
        name        = "protect-main-branch-kong-package-pre-commit-20240822-070844"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-runtime"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"a1d2eab5e1d33933863f7adfa24fdc1b47d1bcfdb51cd4791eee5fe7106c9b46\"" -> "W/\"5b8ebf9ca2ee0cb43c2abab76b9fa5729bea6053dcdd47cfe2430bd90ff89342\""
        id          = "1430818"
        name        = "protect-main-branch-kong-runtime-pre-commit-20240822-070844"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-test-suite"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"17e69c1ce52b0ecc778f680786e912da81d35cbb33dc5f69ec0191652a9a536a\"" -> "W/\"ba6e034cf31d80e3bf7ad4fc0d9224675da59d44ae099cd859dc1ed3a1ac4794\""
        id          = "1482348"
        name        = "protect-main-branch-kong-test-suite-pre-commit-20240822-070844"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["multi-arch-fpm"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"0af542cd365f897a60bf7a101d70651464a75f094350c82e609e5ed4d85766e6\"" -> "W/\"696c7771ece856666f17c23b35b2cc2ffdd29ebc798e8ac8a7a6ca05a5649071\""
        id          = "1430817"
        name        = "protect-main-branch-multi-arch-fpm-pre-commit-20240822-070844"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-github-release"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"e6b0889bf40acfcc726cd2d645b493fb696b4b53a0bef6ffd615e9174bd47b0c\"" -> "W/\"a6c64f8fe5447bee4e4af6c0b86fa827cc2273bef253896b52d1dc7680271aad\""
        id          = "1430803"
        name        = "protect-main-branch-template-1-github-release-pre-commit-20240822-070844"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"c843f16bf40a86dcd66d7dcef848b469c7568e2129f76f2d51a5ed3ad05d2b47\"" -> "W/\"0c595adadb154ca01b197f7607caea6a44c857cc97cf655b367c0743072711d0\""
        id          = "1430814"
        name        = "protect-main-branch-template-1-terraform-pre-commit-20240822-070844"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-template"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"464dd405ff55466beee1035397fc00378b7214725e42bb8e97a4361b23ed21aa\"" -> "W/\"215acf359ae0941f7e40bde6ef1f80e39046f64a45e69d768df264442e9ea617\""
        id          = "1430815"
        name        = "protect-main-branch-template-template-pre-commit-20240822-070844"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["terraform-github"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"6133ff828ec8d99e74ffa1fbf64e62a51305814da6897b8dcd017282a2c80349\"" -> "W/\"cd4a808fe5705cc36637bc886fb69f17d9cedf39a1eb8ce6c14efe4b97271b0f\""
        id          = "1430807"
        name        = "protect-main-branch-terraform-github-pre-commit-20240822-070844"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-build-images"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"c9dd39c25c237509e7fd0a4de4065ff7cc0f5e95d050b342b14766ee520edb31\"" -> "W/\"cabfab1721b7a88b9610d529d7711d1b167fdb3dd69169c53cb7adaed944efca\""
        id          = "1430869"
        name        = "protect-main-branch-kong-build-images-release-20240822-070844"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-development"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"63ad8115902587492136232cf6565c9220ef7d443c5deddad3fa14a5d47f8cd1\"" -> "W/\"561e6347d7fa6609569cdf16e802115ecbd862a2133713e3a93e50bebbd20ea2\""
        id          = "1430871"
        name        = "protect-main-branch-kong-development-release-20240822-070844"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-openssl"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"5f493a9376d40ef1da4d7d7da4d5bbdc3eaa0f0e486bf3dac6e84122a02da69b\"" -> "W/\"175e018a290285428d794019c6f616b7396fc653b9e8d5abf87750cda23e8aef\""
        id          = "1430870"
        name        = "protect-main-branch-kong-openssl-release-20240822-070844"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-package"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"e442f9e25c93397a47dd95207b07cff52ae735cafcc8d3001e63893cd488c6c3\"" -> "W/\"8d9e55eee0a3e22d23c089fb532f4407b5f42b22f6a706d00f7d0701f88fc9a4\""
        id          = "1430873"
        name        = "protect-main-branch-kong-package-release-20240822-070844"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-runtime"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"f49cd9f7131cb673ca7200b078b17e60960a5885083f280a6d86548d2c9d8f1b\"" -> "W/\"87c848849504a927c3f389b766f44639a55fbed185a2a35ac4c986a2f0a96c8c\""
        id          = "1430868"
        name        = "protect-main-branch-kong-runtime-release-20240822-070844"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-test-suite"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"6985fdc149af0c816de67623a6eaaa22ecd8f79e017bee30f009d972b9576fe0\"" -> "W/\"287a76c3cc1d3167654c7108c2acad2f82a508d8e66801a2129179bdc9352cab\""
        id          = "1482346"
        name        = "protect-main-branch-kong-test-suite-release-20240822-070844"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["multi-arch-fpm"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"fe7eb777c54487b6171001e3ec7f7e8c9cfaccdbd4accdf33364d27af35bdde8\"" -> "W/\"6f1d1d9680ef9a40287c8a79812e80910a4cc46fcbb7f12856b1fd421a25f183\""
        id          = "1430872"
        name        = "protect-main-branch-multi-arch-fpm-release-20240822-070844"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["template-1-github-release"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"acc0e794904af6e67872d85ae2f079b18a4d0b46a2b028263c1747668735f5eb\"" -> "W/\"cc3d12d1195845ed254e033e09b550212b19d2e76d2dae393714c06964c57a2f\""
        id          = "1431038"
        name        = "protect-main-branch-template-1-github-release-release-20240822-070844"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
      ~ etag        = "W/\"43880a7b6e90ede58eee531b8c6f308890ee24cc8025895e03b07d34e05ea018\"" -> "W/\"7a51abb2209e8e588ebaf1adab152a3e05932c8eab3fa02a33b723b05c62fa4b\""
        id          = "1430865"
        name        = "protect-main-branch-template-1-terraform-terraform-plan-20240822-070844"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["terraform-github"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
      ~ etag        = "W/\"b1bd7ec5eb41f4f5f3c06b2fb2bd1b84ed390593879c4386671118e5bafe6b45\"" -> "W/\"b947fc16bbbd63e418a108b2b6700e01b083511b7a1b779dac1562a806213b92\""
        id          = "1430864"
        name        = "protect-main-branch-terraform-github-terraform-plan-20240822-070844"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.settings_all["kong-docker"] will be updated in-place
  ~ resource "github_repository" "settings_all" {
        id                          = "kong-docker"
        name                        = "kong-docker"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)


      ~ template {
          ~ repository           = "template-1-github-release" -> "template-template"
            # (2 unchanged attributes hidden)
        }
        # (1 unchanged block hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["atc-router"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1481994"
      ~ name        = "protect-main-branch-atc-router-pre-commit-20240822-070844" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-build-images"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430804"
      ~ name        = "protect-main-branch-kong-build-images-pre-commit-20240822-070844" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-development"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430806"
      ~ name        = "protect-main-branch-kong-development-pre-commit-20240822-070844" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-docker"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_all" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + node_id     = (known after apply)
      + repository  = "kong-docker"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 952934
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "pre-commit"
                  + integration_id = 0
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_all["kong-openssl"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430805"
      ~ name        = "protect-main-branch-kong-openssl-pre-commit-20240822-070844" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-package"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430802"
      ~ name        = "protect-main-branch-kong-package-pre-commit-20240822-070844" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-runtime"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430818"
      ~ name        = "protect-main-branch-kong-runtime-pre-commit-20240822-070844" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-test-suite"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1482348"
      ~ name        = "protect-main-branch-kong-test-suite-pre-commit-20240822-070844" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["multi-arch-fpm"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430817"
      ~ name        = "protect-main-branch-multi-arch-fpm-pre-commit-20240822-070844" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-github-release"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430803"
      ~ name        = "protect-main-branch-template-1-github-release-pre-commit-20240822-070844" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-terraform"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430814"
      ~ name        = "protect-main-branch-template-1-terraform-pre-commit-20240822-070844" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-template"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430815"
      ~ name        = "protect-main-branch-template-template-pre-commit-20240822-070844" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["terraform-github"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430807"
      ~ name        = "protect-main-branch-terraform-github-pre-commit-20240822-070844" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-build-images"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430869"
      ~ name        = "protect-main-branch-kong-build-images-release-20240822-070844" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-development"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430871"
      ~ name        = "protect-main-branch-kong-development-release-20240822-070844" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-docker"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_kong" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + node_id     = (known after apply)
      + repository  = "kong-docker"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 952934
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "Done"
                  + integration_id = 0
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-openssl"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430870"
      ~ name        = "protect-main-branch-kong-openssl-release-20240822-070844" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-package"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430873"
      ~ name        = "protect-main-branch-kong-package-release-20240822-070844" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-runtime"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430868"
      ~ name        = "protect-main-branch-kong-runtime-release-20240822-070844" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-test-suite"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1482346"
      ~ name        = "protect-main-branch-kong-test-suite-release-20240822-070844" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["multi-arch-fpm"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430872"
      ~ name        = "protect-main-branch-multi-arch-fpm-release-20240822-070844" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["template-1-github-release"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1431038"
      ~ name        = "protect-main-branch-template-1-github-release-release-20240822-070844" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["template-1-terraform"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
        id          = "1430865"
      ~ name        = "protect-main-branch-template-1-terraform-terraform-plan-20240822-070844" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["terraform-github"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
        id          = "1430864"
      ~ name        = "protect-main-branch-terraform-github-terraform-plan-20240822-070844" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 23 to change, 0 to destroy.

<!-- Sticky Pull Request Commentterraform-plan -->